Microchip-MPLAB-Harmony/usb_apps_device/apps/msd_sdcard/firmware/src/packs/ATSAMA5D29_DFP/component/tdes.h
/*
 * Component description for TDES
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2022-11-18T13:40:01Z */
#ifndef _SAMA5D_TDES_COMPONENT_H_
#define _SAMA5D_TDES_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR TDES                                         */
/* ************************************************************************** */

/* -------- TDES_CR : (TDES Offset: 0x00) ( /W 32) Control Register -------- */
#define TDES_CR_START_Pos                     _UINT32_(0)                                          /* (TDES_CR) Start Processing Position */
#define TDES_CR_START_Msk                     (_UINT32_(0x1) << TDES_CR_START_Pos)                 /* (TDES_CR) Start Processing Mask */
#define TDES_CR_START(value)                  (TDES_CR_START_Msk & (_UINT32_(value) << TDES_CR_START_Pos)) /* Assigment of value for START in the TDES_CR register */
#define TDES_CR_SWRST_Pos                     _UINT32_(8)                                          /* (TDES_CR) Software Reset Position */
#define TDES_CR_SWRST_Msk                     (_UINT32_(0x1) << TDES_CR_SWRST_Pos)                 /* (TDES_CR) Software Reset Mask */
#define TDES_CR_SWRST(value)                  (TDES_CR_SWRST_Msk & (_UINT32_(value) << TDES_CR_SWRST_Pos)) /* Assigment of value for SWRST in the TDES_CR register */
#define TDES_CR_Msk                           _UINT32_(0x00000101)                                 /* (TDES_CR) Register Mask  */


/* -------- TDES_MR : (TDES Offset: 0x04) (R/W 32) Mode Register -------- */
#define TDES_MR_CIPHER_Pos                    _UINT32_(0)                                          /* (TDES_MR) Processing Mode Position */
#define TDES_MR_CIPHER_Msk                    (_UINT32_(0x1) << TDES_MR_CIPHER_Pos)                /* (TDES_MR) Processing Mode Mask */
#define TDES_MR_CIPHER(value)                 (TDES_MR_CIPHER_Msk & (_UINT32_(value) << TDES_MR_CIPHER_Pos)) /* Assigment of value for CIPHER in the TDES_MR register */
#define   TDES_MR_CIPHER_DECRYPT_Val          _UINT32_(0x0)                                        /* (TDES_MR) Decrypts data.  */
#define   TDES_MR_CIPHER_ENCRYPT_Val          _UINT32_(0x1)                                        /* (TDES_MR) Encrypts data.  */
#define TDES_MR_CIPHER_DECRYPT                (TDES_MR_CIPHER_DECRYPT_Val << TDES_MR_CIPHER_Pos)   /* (TDES_MR) Decrypts data. Position  */
#define TDES_MR_CIPHER_ENCRYPT                (TDES_MR_CIPHER_ENCRYPT_Val << TDES_MR_CIPHER_Pos)   /* (TDES_MR) Encrypts data. Position  */
#define TDES_MR_TDESMOD_Pos                   _UINT32_(1)                                          /* (TDES_MR) ALGORITHM Mode Position */
#define TDES_MR_TDESMOD_Msk                   (_UINT32_(0x3) << TDES_MR_TDESMOD_Pos)               /* (TDES_MR) ALGORITHM Mode Mask */
#define TDES_MR_TDESMOD(value)                (TDES_MR_TDESMOD_Msk & (_UINT32_(value) << TDES_MR_TDESMOD_Pos)) /* Assigment of value for TDESMOD in the TDES_MR register */
#define   TDES_MR_TDESMOD_SINGLE_DES_Val      _UINT32_(0x0)                                        /* (TDES_MR) Single DES processing using Key 1 Registers  */
#define   TDES_MR_TDESMOD_TRIPLE_DES_Val      _UINT32_(0x1)                                        /* (TDES_MR) Triple DES processing using Key 1, Key 2 and Key 3 Registers  */
#define   TDES_MR_TDESMOD_XTEA_Val            _UINT32_(0x2)                                        /* (TDES_MR) XTEA processing using Key 1 and Key 2 Registers  */
#define TDES_MR_TDESMOD_SINGLE_DES            (TDES_MR_TDESMOD_SINGLE_DES_Val << TDES_MR_TDESMOD_Pos) /* (TDES_MR) Single DES processing using Key 1 Registers Position  */
#define TDES_MR_TDESMOD_TRIPLE_DES            (TDES_MR_TDESMOD_TRIPLE_DES_Val << TDES_MR_TDESMOD_Pos) /* (TDES_MR) Triple DES processing using Key 1, Key 2 and Key 3 Registers Position  */
#define TDES_MR_TDESMOD_XTEA                  (TDES_MR_TDESMOD_XTEA_Val << TDES_MR_TDESMOD_Pos)    /* (TDES_MR) XTEA processing using Key 1 and Key 2 Registers Position  */
#define TDES_MR_KEYMOD_Pos                    _UINT32_(4)                                          /* (TDES_MR) Key Mode Position */
#define TDES_MR_KEYMOD_Msk                    (_UINT32_(0x1) << TDES_MR_KEYMOD_Pos)                /* (TDES_MR) Key Mode Mask */
#define TDES_MR_KEYMOD(value)                 (TDES_MR_KEYMOD_Msk & (_UINT32_(value) << TDES_MR_KEYMOD_Pos)) /* Assigment of value for KEYMOD in the TDES_MR register */
#define TDES_MR_SMOD_Pos                      _UINT32_(8)                                          /* (TDES_MR) Start Mode Position */
#define TDES_MR_SMOD_Msk                      (_UINT32_(0x3) << TDES_MR_SMOD_Pos)                  /* (TDES_MR) Start Mode Mask */
#define TDES_MR_SMOD(value)                   (TDES_MR_SMOD_Msk & (_UINT32_(value) << TDES_MR_SMOD_Pos)) /* Assigment of value for SMOD in the TDES_MR register */
#define   TDES_MR_SMOD_MANUAL_START_Val       _UINT32_(0x0)                                        /* (TDES_MR) Manual Mode  */
#define   TDES_MR_SMOD_AUTO_START_Val         _UINT32_(0x1)                                        /* (TDES_MR) Auto Mode  */
#define   TDES_MR_SMOD_IDATAR0_START_Val      _UINT32_(0x2)                                        /* (TDES_MR) TDES_IDATAR0 accesses only Auto Mode  */
#define TDES_MR_SMOD_MANUAL_START             (TDES_MR_SMOD_MANUAL_START_Val << TDES_MR_SMOD_Pos)  /* (TDES_MR) Manual Mode Position  */
#define TDES_MR_SMOD_AUTO_START               (TDES_MR_SMOD_AUTO_START_Val << TDES_MR_SMOD_Pos)    /* (TDES_MR) Auto Mode Position  */
#define TDES_MR_SMOD_IDATAR0_START            (TDES_MR_SMOD_IDATAR0_START_Val << TDES_MR_SMOD_Pos) /* (TDES_MR) TDES_IDATAR0 accesses only Auto Mode Position  */
#define TDES_MR_OPMOD_Pos                     _UINT32_(12)                                         /* (TDES_MR) Operating Mode Position */
#define TDES_MR_OPMOD_Msk                     (_UINT32_(0x3) << TDES_MR_OPMOD_Pos)                 /* (TDES_MR) Operating Mode Mask */
#define TDES_MR_OPMOD(value)                  (TDES_MR_OPMOD_Msk & (_UINT32_(value) << TDES_MR_OPMOD_Pos)) /* Assigment of value for OPMOD in the TDES_MR register */
#define   TDES_MR_OPMOD_ECB_Val               _UINT32_(0x0)                                        /* (TDES_MR) Electronic Code Book mode  */
#define   TDES_MR_OPMOD_CBC_Val               _UINT32_(0x1)                                        /* (TDES_MR) Cipher Block Chaining mode  */
#define   TDES_MR_OPMOD_OFB_Val               _UINT32_(0x2)                                        /* (TDES_MR) Output Feedback mode  */
#define   TDES_MR_OPMOD_CFB_Val               _UINT32_(0x3)                                        /* (TDES_MR) Cipher Feedback mode  */
#define TDES_MR_OPMOD_ECB                     (TDES_MR_OPMOD_ECB_Val << TDES_MR_OPMOD_Pos)         /* (TDES_MR) Electronic Code Book mode Position  */
#define TDES_MR_OPMOD_CBC                     (TDES_MR_OPMOD_CBC_Val << TDES_MR_OPMOD_Pos)         /* (TDES_MR) Cipher Block Chaining mode Position  */
#define TDES_MR_OPMOD_OFB                     (TDES_MR_OPMOD_OFB_Val << TDES_MR_OPMOD_Pos)         /* (TDES_MR) Output Feedback mode Position  */
#define TDES_MR_OPMOD_CFB                     (TDES_MR_OPMOD_CFB_Val << TDES_MR_OPMOD_Pos)         /* (TDES_MR) Cipher Feedback mode Position  */
#define TDES_MR_LOD_Pos                       _UINT32_(15)                                         /* (TDES_MR) Last Output Data Mode Position */
#define TDES_MR_LOD_Msk                       (_UINT32_(0x1) << TDES_MR_LOD_Pos)                   /* (TDES_MR) Last Output Data Mode Mask */
#define TDES_MR_LOD(value)                    (TDES_MR_LOD_Msk & (_UINT32_(value) << TDES_MR_LOD_Pos)) /* Assigment of value for LOD in the TDES_MR register */
#define TDES_MR_CFBS_Pos                      _UINT32_(16)                                         /* (TDES_MR) Cipher Feedback Data Size Position */
#define TDES_MR_CFBS_Msk                      (_UINT32_(0x3) << TDES_MR_CFBS_Pos)                  /* (TDES_MR) Cipher Feedback Data Size Mask */
#define TDES_MR_CFBS(value)                   (TDES_MR_CFBS_Msk & (_UINT32_(value) << TDES_MR_CFBS_Pos)) /* Assigment of value for CFBS in the TDES_MR register */
#define   TDES_MR_CFBS_SIZE_64BIT_Val         _UINT32_(0x0)                                        /* (TDES_MR) 64-bit  */
#define   TDES_MR_CFBS_SIZE_32BIT_Val         _UINT32_(0x1)                                        /* (TDES_MR) 32-bit  */
#define   TDES_MR_CFBS_SIZE_16BIT_Val         _UINT32_(0x2)                                        /* (TDES_MR) 16-bit  */
#define   TDES_MR_CFBS_SIZE_8BIT_Val          _UINT32_(0x3)                                        /* (TDES_MR) 8-bit  */
#define TDES_MR_CFBS_SIZE_64BIT               (TDES_MR_CFBS_SIZE_64BIT_Val << TDES_MR_CFBS_Pos)    /* (TDES_MR) 64-bit Position  */
#define TDES_MR_CFBS_SIZE_32BIT               (TDES_MR_CFBS_SIZE_32BIT_Val << TDES_MR_CFBS_Pos)    /* (TDES_MR) 32-bit Position  */
#define TDES_MR_CFBS_SIZE_16BIT               (TDES_MR_CFBS_SIZE_16BIT_Val << TDES_MR_CFBS_Pos)    /* (TDES_MR) 16-bit Position  */
#define TDES_MR_CFBS_SIZE_8BIT                (TDES_MR_CFBS_SIZE_8BIT_Val << TDES_MR_CFBS_Pos)     /* (TDES_MR) 8-bit Position  */
#define TDES_MR_Msk                           _UINT32_(0x0003B317)                                 /* (TDES_MR) Register Mask  */


/* -------- TDES_IER : (TDES Offset: 0x10) ( /W 32) Interrupt Enable Register -------- */
#define TDES_IER_DATRDY_Pos                   _UINT32_(0)                                          /* (TDES_IER) Data Ready Interrupt Enable Position */
#define TDES_IER_DATRDY_Msk                   (_UINT32_(0x1) << TDES_IER_DATRDY_Pos)               /* (TDES_IER) Data Ready Interrupt Enable Mask */
#define TDES_IER_DATRDY(value)                (TDES_IER_DATRDY_Msk & (_UINT32_(value) << TDES_IER_DATRDY_Pos)) /* Assigment of value for DATRDY in the TDES_IER register */
#define TDES_IER_URAD_Pos                     _UINT32_(8)                                          /* (TDES_IER) Unspecified Register Access Detection Interrupt Enable Position */
#define TDES_IER_URAD_Msk                     (_UINT32_(0x1) << TDES_IER_URAD_Pos)                 /* (TDES_IER) Unspecified Register Access Detection Interrupt Enable Mask */
#define TDES_IER_URAD(value)                  (TDES_IER_URAD_Msk & (_UINT32_(value) << TDES_IER_URAD_Pos)) /* Assigment of value for URAD in the TDES_IER register */
#define TDES_IER_Msk                          _UINT32_(0x00000101)                                 /* (TDES_IER) Register Mask  */


/* -------- TDES_IDR : (TDES Offset: 0x14) ( /W 32) Interrupt Disable Register -------- */
#define TDES_IDR_DATRDY_Pos                   _UINT32_(0)                                          /* (TDES_IDR) Data Ready Interrupt Disable Position */
#define TDES_IDR_DATRDY_Msk                   (_UINT32_(0x1) << TDES_IDR_DATRDY_Pos)               /* (TDES_IDR) Data Ready Interrupt Disable Mask */
#define TDES_IDR_DATRDY(value)                (TDES_IDR_DATRDY_Msk & (_UINT32_(value) << TDES_IDR_DATRDY_Pos)) /* Assigment of value for DATRDY in the TDES_IDR register */
#define TDES_IDR_URAD_Pos                     _UINT32_(8)                                          /* (TDES_IDR) Unspecified Register Access Detection Interrupt Disable Position */
#define TDES_IDR_URAD_Msk                     (_UINT32_(0x1) << TDES_IDR_URAD_Pos)                 /* (TDES_IDR) Unspecified Register Access Detection Interrupt Disable Mask */
#define TDES_IDR_URAD(value)                  (TDES_IDR_URAD_Msk & (_UINT32_(value) << TDES_IDR_URAD_Pos)) /* Assigment of value for URAD in the TDES_IDR register */
#define TDES_IDR_Msk                          _UINT32_(0x00000101)                                 /* (TDES_IDR) Register Mask  */


