Microchip-MPLAB-Harmony/usb_apps_device/apps/msd_sdcard/firmware/src/packs/ATSAMA5D29_DFP/component/tdes.h
/* -------- TDES_IMR : (TDES Offset: 0x18) ( R/ 32) Interrupt Mask Register -------- */
#define TDES_IMR_DATRDY_Pos                   _UINT32_(0)                                          /* (TDES_IMR) Data Ready Interrupt Mask Position */
#define TDES_IMR_DATRDY_Msk                   (_UINT32_(0x1) << TDES_IMR_DATRDY_Pos)               /* (TDES_IMR) Data Ready Interrupt Mask Mask */
#define TDES_IMR_DATRDY(value)                (TDES_IMR_DATRDY_Msk & (_UINT32_(value) << TDES_IMR_DATRDY_Pos)) /* Assigment of value for DATRDY in the TDES_IMR register */
#define TDES_IMR_URAD_Pos                     _UINT32_(8)                                          /* (TDES_IMR) Unspecified Register Access Detection Interrupt Mask Position */
#define TDES_IMR_URAD_Msk                     (_UINT32_(0x1) << TDES_IMR_URAD_Pos)                 /* (TDES_IMR) Unspecified Register Access Detection Interrupt Mask Mask */
#define TDES_IMR_URAD(value)                  (TDES_IMR_URAD_Msk & (_UINT32_(value) << TDES_IMR_URAD_Pos)) /* Assigment of value for URAD in the TDES_IMR register */
#define TDES_IMR_Msk                          _UINT32_(0x00000101)                                 /* (TDES_IMR) Register Mask  */


/* -------- TDES_ISR : (TDES Offset: 0x1C) ( R/ 32) Interrupt Status Register -------- */
#define TDES_ISR_DATRDY_Pos                   _UINT32_(0)                                          /* (TDES_ISR) Data Ready (cleared by setting bit START or bit SWRST in TDES_CR or by reading TDES_ODATARx) Position */
#define TDES_ISR_DATRDY_Msk                   (_UINT32_(0x1) << TDES_ISR_DATRDY_Pos)               /* (TDES_ISR) Data Ready (cleared by setting bit START or bit SWRST in TDES_CR or by reading TDES_ODATARx) Mask */
#define TDES_ISR_DATRDY(value)                (TDES_ISR_DATRDY_Msk & (_UINT32_(value) << TDES_ISR_DATRDY_Pos)) /* Assigment of value for DATRDY in the TDES_ISR register */
#define TDES_ISR_URAD_Pos                     _UINT32_(8)                                          /* (TDES_ISR) Unspecified Register Access Detection Status (cleared by setting bit TDES_CR.SWRST) Position */
#define TDES_ISR_URAD_Msk                     (_UINT32_(0x1) << TDES_ISR_URAD_Pos)                 /* (TDES_ISR) Unspecified Register Access Detection Status (cleared by setting bit TDES_CR.SWRST) Mask */
#define TDES_ISR_URAD(value)                  (TDES_ISR_URAD_Msk & (_UINT32_(value) << TDES_ISR_URAD_Pos)) /* Assigment of value for URAD in the TDES_ISR register */
#define TDES_ISR_URAT_Pos                     _UINT32_(12)                                         /* (TDES_ISR) Unspecified Register Access (cleared by setting bit TDES_CR.SWRST) Position */
#define TDES_ISR_URAT_Msk                     (_UINT32_(0x3) << TDES_ISR_URAT_Pos)                 /* (TDES_ISR) Unspecified Register Access (cleared by setting bit TDES_CR.SWRST) Mask */
#define TDES_ISR_URAT(value)                  (TDES_ISR_URAT_Msk & (_UINT32_(value) << TDES_ISR_URAT_Pos)) /* Assigment of value for URAT in the TDES_ISR register */
#define   TDES_ISR_URAT_IDR_WR_PROCESSING_Val _UINT32_(0x0)                                        /* (TDES_ISR) Input Data Register written during data processing when SMOD = 0x2 mode.  */
#define   TDES_ISR_URAT_ODR_RD_PROCESSING_Val _UINT32_(0x1)                                        /* (TDES_ISR) Output Data Register read during data processing.  */
#define   TDES_ISR_URAT_MR_WR_PROCESSING_Val  _UINT32_(0x2)                                        /* (TDES_ISR) Mode Register written during data processing.  */
#define   TDES_ISR_URAT_WOR_RD_ACCESS_Val     _UINT32_(0x3)                                        /* (TDES_ISR) Write-only register read access.  */
#define TDES_ISR_URAT_IDR_WR_PROCESSING       (TDES_ISR_URAT_IDR_WR_PROCESSING_Val << TDES_ISR_URAT_Pos) /* (TDES_ISR) Input Data Register written during data processing when SMOD = 0x2 mode. Position  */
#define TDES_ISR_URAT_ODR_RD_PROCESSING       (TDES_ISR_URAT_ODR_RD_PROCESSING_Val << TDES_ISR_URAT_Pos) /* (TDES_ISR) Output Data Register read during data processing. Position  */
#define TDES_ISR_URAT_MR_WR_PROCESSING        (TDES_ISR_URAT_MR_WR_PROCESSING_Val << TDES_ISR_URAT_Pos) /* (TDES_ISR) Mode Register written during data processing. Position  */
#define TDES_ISR_URAT_WOR_RD_ACCESS           (TDES_ISR_URAT_WOR_RD_ACCESS_Val << TDES_ISR_URAT_Pos) /* (TDES_ISR) Write-only register read access. Position  */
#define TDES_ISR_Msk                          _UINT32_(0x00003101)                                 /* (TDES_ISR) Register Mask  */


/* -------- TDES_KEY1WR : (TDES Offset: 0x20) ( /W 32) Key 1 Word Register -------- */
#define TDES_KEY1WR_KEY1W_Pos                 _UINT32_(0)                                          /* (TDES_KEY1WR) Key 1 Word Position */
#define TDES_KEY1WR_KEY1W_Msk                 (_UINT32_(0xFFFFFFFF) << TDES_KEY1WR_KEY1W_Pos)      /* (TDES_KEY1WR) Key 1 Word Mask */
#define TDES_KEY1WR_KEY1W(value)              (TDES_KEY1WR_KEY1W_Msk & (_UINT32_(value) << TDES_KEY1WR_KEY1W_Pos)) /* Assigment of value for KEY1W in the TDES_KEY1WR register */
#define TDES_KEY1WR_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (TDES_KEY1WR) Register Mask  */


/* -------- TDES_KEY2WR : (TDES Offset: 0x28) ( /W 32) Key 2 Word Register -------- */
#define TDES_KEY2WR_KEY2W_Pos                 _UINT32_(0)                                          /* (TDES_KEY2WR) Key 2 Word Position */
#define TDES_KEY2WR_KEY2W_Msk                 (_UINT32_(0xFFFFFFFF) << TDES_KEY2WR_KEY2W_Pos)      /* (TDES_KEY2WR) Key 2 Word Mask */
#define TDES_KEY2WR_KEY2W(value)              (TDES_KEY2WR_KEY2W_Msk & (_UINT32_(value) << TDES_KEY2WR_KEY2W_Pos)) /* Assigment of value for KEY2W in the TDES_KEY2WR register */
#define TDES_KEY2WR_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (TDES_KEY2WR) Register Mask  */


/* -------- TDES_KEY3WR : (TDES Offset: 0x30) ( /W 32) Key 3 Word Register -------- */
#define TDES_KEY3WR_KEY3W_Pos                 _UINT32_(0)                                          /* (TDES_KEY3WR) Key 3 Word Position */
#define TDES_KEY3WR_KEY3W_Msk                 (_UINT32_(0xFFFFFFFF) << TDES_KEY3WR_KEY3W_Pos)      /* (TDES_KEY3WR) Key 3 Word Mask */
#define TDES_KEY3WR_KEY3W(value)              (TDES_KEY3WR_KEY3W_Msk & (_UINT32_(value) << TDES_KEY3WR_KEY3W_Pos)) /* Assigment of value for KEY3W in the TDES_KEY3WR register */
#define TDES_KEY3WR_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (TDES_KEY3WR) Register Mask  */


/* -------- TDES_IDATAR : (TDES Offset: 0x40) ( /W 32) Input Data Register -------- */
#define TDES_IDATAR_IDATA_Pos                 _UINT32_(0)                                          /* (TDES_IDATAR) Input Data Position */
#define TDES_IDATAR_IDATA_Msk                 (_UINT32_(0xFFFFFFFF) << TDES_IDATAR_IDATA_Pos)      /* (TDES_IDATAR) Input Data Mask */
#define TDES_IDATAR_IDATA(value)              (TDES_IDATAR_IDATA_Msk & (_UINT32_(value) << TDES_IDATAR_IDATA_Pos)) /* Assigment of value for IDATA in the TDES_IDATAR register */
#define TDES_IDATAR_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (TDES_IDATAR) Register Mask  */


/* -------- TDES_ODATAR : (TDES Offset: 0x50) ( R/ 32) Output Data Register -------- */
#define TDES_ODATAR_ODATA_Pos                 _UINT32_(0)                                          /* (TDES_ODATAR) Output Data Position */
#define TDES_ODATAR_ODATA_Msk                 (_UINT32_(0xFFFFFFFF) << TDES_ODATAR_ODATA_Pos)      /* (TDES_ODATAR) Output Data Mask */
#define TDES_ODATAR_ODATA(value)              (TDES_ODATAR_ODATA_Msk & (_UINT32_(value) << TDES_ODATAR_ODATA_Pos)) /* Assigment of value for ODATA in the TDES_ODATAR register */
#define TDES_ODATAR_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (TDES_ODATAR) Register Mask  */


